attacker/data/ac/spoofing/ab_results/ab_103.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   44.999 seconds
Complete requests:      20
Failed requests:        18
   (Connect: 0, Receive: 0, Length: 18, Exceptions: 0)
Keep-Alive requests:    2
Total transferred:      488 bytes
HTML transferred:       190 bytes
Requests per second:    0.44 [#/sec] (mean)
Time per request:       22499.519 [ms] (mean)
Time per request:       2249.952 [ms] (mean, across all concurrent requests)
Transfer rate:          0.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   1.7      3       9
Processing:     3 2255 8157.3      6   35795
Waiting:        0 2250 8158.4      0   35794
Total:          5 2258 8157.0      9   35798

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     13
  90%   9201
  95%  35798
  98%  35798
  99%  35798
 100%  35798 (longest request)
